docs/Topics/Emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 23:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs</title>
<meta name="author" content="Elle Najt" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Emacs</h1>
<div id="outline-container-orga334498" class="outline-2">
<h2 id="orga334498">Why Emacs:</h2>
<div class="outline-text-2" id="text-orga334498">
<p>
Even as LLMs consume the world, I think emacs still has a place &#x2013; maybe more of a place, since the frictions around customizing emacs are going to zero. Some work flows that I previously managed with emacs I manage with agents (e.g. managing git), but others still belong in emacs (like managing what I&rsquo;m working on, and moving between streams quickly).<br />
</p>
</div>
<div id="outline-container-orgb7169b3" class="outline-3">
<h3 id="orgb7169b3">Truly customizable and extensible</h3>
<div class="outline-text-3" id="text-orgb7169b3">
<p>
I can shape my editor into a tool that fits me, instead of contorting myself to fit someone else&rsquo;s UI design.<br />
</p>

<p>
Once you get the hang of it, modifying emacs becomes easy and fun. LLM agents make it really easy.<br />
</p>
</div>
</div>
<div id="outline-container-orgbab4790" class="outline-3">
<h3 id="orgbab4790">Emacs is really fun!</h3>
<div class="outline-text-3" id="text-orgbab4790">
<p>
That&rsquo;s the main reason I like it!<br />
Fun is a signal, not frivolity.<br />
Fun leads to flow, and flow leads to deep work and curiosity and creativity.<br />
</p>
</div>
</div>
<div id="outline-container-org49b840d" class="outline-3">
<h3 id="org49b840d">Better than a clicking based GUI or a CLI:</h3>
<div class="outline-text-3" id="text-org49b840d">
<p>
I also find that the transient menu style interface fits much better in my brain than CLI or standard click-on-dropdown-menu based GUIs.<br />
</p>

<p>
Stuff that I use frequently becomes muscle memory, and for stuff that I don&rsquo;t use frequently I get gentle, immediate and usually useful hints from the system about what I&rsquo;m trying to do.<br />
</p>
</div>
</div>
<div id="outline-container-org21fce1b" class="outline-3">
<h3 id="org21fce1b">Great Aesthetics</h3>
<div class="outline-text-3" id="text-org21fce1b">
<p>
Who doesn&rsquo;t want to look like an 80s hacker when they work.<br />
</p>
</div>
</div>
<div id="outline-container-org2c2b535" class="outline-3">
<h3 id="org2c2b535">All-encompassing</h3>
<div class="outline-text-3" id="text-org2c2b535">
<p>
Emacs can absorb pretty much all parts of your workflow into the same extensible system.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org69d3950" class="outline-2">
<h2 id="org69d3950">Favorite features:</h2>
<div class="outline-text-2" id="text-org69d3950">
</div>
<div id="outline-container-org4dad904" class="outline-3">
<h3 id="org4dad904">Org mode:</h3>
<div class="outline-text-3" id="text-org4dad904">
</div>
<div id="outline-container-org7a4bdc1" class="outline-4">
<h4 id="org7a4bdc1">Org babel as a replacement for jupyter notebooks</h4>
<div class="outline-text-4" id="text-org7a4bdc1">
<p>
Literate code!<br />
</p>

<p>
<a href="https://github.com/ElleNajt/ElleNajt.github.io/blob/master/Code/OrgBabelExample/example.org">Here&rsquo;s an example of an org babel file as a generic data science notebook!</a><br />
<a href="../Code/OrgBabelExample/example.html">Here&rsquo;s what it looks like when published to html.</a><br />
</p>

<p>
There are some missing features, and I&rsquo;ve written a package that adds the ones I&rsquo;ve missed the most <a href="https://github.com/ElleNajt/ob-python-extras?tab=readme-ov-file">a package that adds them.</a><br />
</p>
</div>
</div>
<div id="outline-container-org22569e4" class="outline-4">
<h4 id="org22569e4">Org todos / agenda</h4>
<div class="outline-text-4" id="text-org22569e4">
<p>
I love that I can collect todos from my org babel notebooks! No more running todo lists, org just collects them in their natural contexts.<br />
</p>
</div>
</div>
<div id="outline-container-orgb84e62a" class="outline-4">
<h4 id="orgb84e62a">Org publish:</h4>
<div class="outline-text-4" id="text-orgb84e62a">
<p>
I can take all my notes, with code and diagrams and latex, and easily publish them to the Internet. That&rsquo;s how this webpage is generated, and it only takes a <a href="https://github.com/ElleNajt/ElleNajt.github.io/blob/master/publish.el">few lines of config</a> to get going.<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org6d0212e"></a>Cool features:<br />
<div class="outline-text-5" id="text-org6d0212e">
<ul class="org-ul">
<li>I can drop todos in my webpage org files and have them hidden by default by visible in my agenda.<br /></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbc98682" class="outline-3">
<h3 id="orgbc98682">Magit</h3>
<div class="outline-text-3" id="text-orgbc98682">
<p>
I don&rsquo;t think I would have learned git so thoroughly without magit. I love having all the options clearly available to me, it makes visualizing staging hunks of code clear, and it simplifies rebasing by having all the information visible and/or automatically loaded based on cursor location.<br />
</p>
</div>
</div>
<div id="outline-container-org37005ea" class="outline-3">
<h3 id="org37005ea">Dired/dirvish</h3>
<div class="outline-text-3" id="text-org37005ea">
<ul class="org-ul">
<li>wdired is magic &#x2013; I love being able to treat things that don&rsquo;t feel editable as editable, actually. (Consult-ripgep embark has the same flavor.)<br /></li>
<li>! or &amp; then command (e.g. firefox) on the highlighted file(s) = yay<br />
it&rsquo;s also smart about guessing what you want to do!<br /></li>
<li>Tab on a file or a folder!<br /></li>
<li>M for changing permissions<br /></li>
<li>Mapping W to dired-do-eww<br /></li>
<li>Bookmarks for your file system<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org390858c" class="outline-2">
<h2 id="org390858c">Config:</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Elle Najt</p>
<p class="email">Email: <a href="mailto:LNAJT4@gmail.com">LNAJT4@gmail.com</a></p>
<p class="date">Created: 2026-02-21 Sat 23:33</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
